Repository: dvla/evl-public-code
Catalog: EVLPublicCode/EVLPublicCode/App_GlobalResources/EVLText.*.resx
Languages: cy_gb

source: Alt VED commencement date
cy_gb: Dyddiad cychwyn Alt VED

# ApplicationReferenceText
source: Your application reference
cy_gb: Cyfeirnod eich cais

# BackToPaymentText
source: Back to payment
cy_gb: Yn ôl i'r taliad

# BackToStartText
source: Go back to start page
cy_gb: Yn ôl i'r dudalen gyntaf

source: Band rate
cy_gb: Cyfradd band

# Cancel
source: Cancel application
cy_gb: Canslo cais

# CancelText
source: Cancel
cy_gb: Canslo

# CardDeclarationText
source: Once payment is taken this is a non-reversible transaction.
cy_gb: Unwaith y cymerir taliad ni ellir dad-wneud

source: Card expiry date
cy_gb: Dyddiad y mae'r cerdyn yn dod i ben

# CardExpiryDateInvalid
source: Enter valid expiry date
cy_gb: Rhowch ddyddiad dod i ben dilys

# CardExpiryMonthMissing
source: Enter month of expiry<br />
cy_gb: Rhowch y mis dod i ben <br />

# CardExpiryYearMissing
source: Enter year of expiry<br />
cy_gb: Rhowch y flwyddyn dod i ben<br />

# CardIssueDate
source: Valid from date
cy_gb: Dyddiad yn ddilys o

# CardIssueDateInvalid
source: Date cannot be in the future
cy_gb: Ni all y dyddiad fod yn y dyfodol

# CardIssueMonthMissing
source: Enter date of expiry<br />
cy_gb: Rhowch y dyddiad dod i ben<br />

source: Card issue number
cy_gb: Rhif cyhoeddi'r cerdyn

# CardIssueNumberInvalid
source: The issue number is invalid
cy_gb: Mae'r rhif cyhoeddi'n annilys

# CardIssueNumberMissing
source: Card issue number must be provided
cy_gb: Rhaid rhoi rhif cyhoeddi

# CardIssueYearMissing
source: Enter date of expiry
cy_gb: Rhowch ddyddiad dod i ben

source: Card number
cy_gb: Rhif y cerdyn

# CardNumberInvalid
source: Card number is invalid. The card number should be between 13 and 19 digits.
cy_gb: Rhif y cerdyn yn annilys. Dylai rhif y cerdyn fod rhwng 13 ac 19 digid.

# CardNumberMissing
source: Enter full card number
cy_gb: Rhowch rif llawn y cerdyn

# CardSecurityCode
source: Last 3 digits of card security code
cy_gb: Tri rhif olaf cod diogelwch y cerdyn

# CardSecurityCodeInvalid
source: The card security code is invalid<br />
cy_gb: Mae cod diogelwch y cerdyn yn annilys<br />

# CardSecurityCodeMissing
source: Enter card security code
cy_gb: Rhowch god diogelwch y cerdyn

# CardSecurityCodeText
source: The last three digits on the signature strip
cy_gb: Y tri digid olaf ar y slip llofnod

source: Card surcharge paid
cy_gb: Talwyd gordaliad cerdyn

source: Card type
cy_gb: Math o gerdyn

# CertificateValidFrom
source: Your certificate will need to be valid on
cy_gb: Bydd angen i'ch tystysgrif dod yn ddilys ar

# CheckDetailsHeader
source: Vehicle details
cy_gb: Manylion cerdyn

# CheckDetailsNumberPlateMessage
source: Vehicle registration number
cy_gb: Rhif cofrestru'r cerbyd

# Co2Text
source: CO₂ emissions
cy_gb: Allyriadau CO₂

# ContinueText
source: Continue
cy_gb: Parhau

# CustomerSurname
source: Up to the first 3 characters of surname of disability exemption certificate holder e.g. woz
cy_gb: Hyd at y 3 nod cyntaf o gyfenw o ddeilydd y dystysgrif eithriad ar sail anabledd e.e. Woz

# CustomerSurnameErrorPrompt
source: Please provide the first 3 characters of your surname
cy_gb: Rhowch 3 nod cyntaf eich cyfenw

# CylinderCapacityText
source: Cylinder capacity (cc)
cy_gb: Maint silindr (cc)

# DateOfBirth
source: Please enter the date of birth of the disability exemption certificate holder (DD/MM/YYYY)
cy_gb: Rhowch ddyddiad geni deilydd y dystysgrif eithriad ar sail anabledd (DD/MM/YYYY)

# DateOfBirthErrorPrompt
source: Please enter a correct date of birth
cy_gb: Rhowch ddyddiad geni cywir

# DateOfFirstRegistrationText
source: Date of first registration
cy_gb: Dyddiad cofrestru cyntaf

# DateofLastV5CIssuedText
source: Date of last V5C issued
cy_gb: Dyddiad cyhoeddi'r V5C diwethaf

source: Date of liability
cy_gb: Dyddiad atebolrwydd

# DaysAgo
source: {0} days ago
cy_gb: o ddyddiau yn ôl

source: Displaying
cy_gb: Yn arddangos

source: Duration
cy_gb: Cyfnod

# EitherMakeFromDDLorTextBox
source: You must select a make from the list or enter your vehicle make in the text field
cy_gb: Rhaid i chi ddewis gwneuthuriad o'r rhestr neu roi gwneuthuriad eich cerbyd yn y maes testun

# EmailAddressDeclaration
source: The email address and/or mobile number supplied by you may also be used to ask about your experience of using this service, or to gain further insight around other motoring services.<br/>The DVLA does not share mobile phone numbers or email addresses with any outside organisations.
cy_gb: Gall y cyfeiriad e-bost a /neu rif ffôn symudol a ddarperir gennych gael ei ddefnyddio hefyd i ofyn am eich profiad o ddefnyddio'r gwasanaeth hwn, neu er mwyn cael mwy o wybodaeth ynghylch gwasanaethau moduro eraill.<br/>Nid yw'r DVLA yn rhannu rhifau ffôn symudol neu gyfeiriadau e-bost gydag unrhyw sefydliadau allanol.

# EmailAddressOptOut
source: Please tick if you wish to be sent information.
cy_gb: Ticiwch os hoffech gael gwybodaeth wedi ei hanfon atoch

# EmailAddressSornDeclarationText
source: An email will be sent to confirm your transaction if you provide a valid email address. DVLA will not send you an acknowledgement letter.
cy_gb: Anfonir e-bost atoch i gadarnhau eich gweithred os rhowch gyfeiriad e-bost dilys. Ni fydd y DVLA yn anfon llythyr cydnabod atoch.

# EmailAddressText
source: Email address (optional. An email will be sent to confirm your transaction).
cy_gb: Cyfeiriad e-bost (dewisol. Anfonir e-bost i gadarnhau eich trafodion)

# EmailConfirmationText
source: Please enter a valid email address
cy_gb: Rhowch gyfeiriad e-bost dilys

# ExemptionCertificateNumber
source: VED exemption certificate serial number (found on your WPMS or DLA404 certificate issued by SPVA & DWP)
cy_gb: Rhif cyfres tystysgrif eithrio VED (cewch hyd iddo ar eich tystysgrif WPMS neu DLA404 a gyhoeddwyd gan SPVA & DWP)

# ExemptionCertificateNumberErrorPrompt
source: Please enter your serial number
cy_gb: Rhowch rif cyfres

# ExportMarkerText
source: Export marker
cy_gb: Marciwr allforio

# Finish
source: Finished
cy_gb: Wedi gorffen

# ForText
source: for
cy_gb: ar gyfer

# ForVehicleRegistrationText
source: for vehicle registration
cy_gb: ar gyfer cofrestru cerbyd

# FuelTypeText
source: Fuel type
cy_gb: Math o danwydd

# IncludeV5CMessage
source: Please include the incorrect V5C registration certificate for amendment.
cy_gb: Rhowch y dystysgrif gofrestru V5C anghywir i'w diwygio.

# IncorrectVehicleDetailsMessage
source: If you think that the details on the vehicle record are incorrect please write to:
cy_gb: Os credwch fod y manylion ar gofnod y cerbyd yn anghywir, ysgrifennwch at:

source: Item
cy_gb: Eitem

# MobileNumberText
source: Mobile number (optional)
cy_gb: Rhif ffôn symudol (dewisol)

# MobileNumberValidatorText
source: Please enter a valid mobile number
cy_gb: Rhowch rif ffôn symudol dilys

# MonthAgo
source: 1 month ago
cy_gb: 1 mis yn ôl

# MonthConfirmationText
source: month vehicle tax
cy_gb: disg dreth fisol

# MonthsAgo
source: {0} months ago
cy_gb: {0} o fisoedd yn ôl

# MotDeclaration
source: Please select the appropriate declaration:
cy_gb: Dewiswch y datganiad priodol:

# MotDeclarationCorrect
source: I declare this is correct
cy_gb: Rwy'n datgan fod hyn yn gywir

# MotDeclarationErrorMessage
source: Please select a MOT/GVT declaration
cy_gb: Dewiswch ddatganiad MOT/GVT

# MotDeclarationIncorrect
source: I declare this is incorrect
cy_gb: Rwy'n datgan fod hwn yn anghywir

# NiNumber
source: National Insurance (NI) number of disability exemption certificate holder e.g. AB123456X
cy_gb: Rhif Yswiriant Gwladol (NI) deilydd y dystysgrif eithriad ar sail anabledd e.e. AB123456X

# NiNumberErrorPrompt
source: Please enter a valid National Insurance number
cy_gb: Rhowch rif Yswiriant Gwladol dilys

# NoReminderTaxMessage
source: I don't have the V11 reminder, just the registration certificate or new keeper supplement
cy_gb: Nid yw'r ffurflen atgoffa V11W gennyf, dim ond y dystysgrif gofestru neu'r atodiad ceidwad newydd

# NoV11HeaderSORN
source: If you are an existing keeper, you can SORN your vehicle online using the vehicle registration number (number plate) and registration certificate (log book).
cy_gb: Os ydych eisoes yn geidwad, gallwch wneud HOS ar eich cerbyd drwy ddefnyddio rhif cofrestru’r cerbyd (plât rhif) a’r dystysgrif cofrestru (llyfr log).

source: Number of axles
cy_gb: Nifer o echelau

source: Number plate
cy_gb: Rhif plât

# OfText
source: of
cy_gb: o

source: Payment summary
cy_gb: Crynodeb taliad

# PayNowButtonText
source: Pay now
cy_gb: Talu nawr

source: Price
cy_gb: Pris

# RenewalPeriodHeaderText
source: How would you prefer to pay?
cy_gb: Sut y byddai'n well gennych dalu?

# RenewTaxConfirmationText
source: Done
cy_gb: Wedi ei wneud

# RenewTaxConfirmVehicleText
source: Vehicle details
cy_gb: Manylion y cerbyd

# RenewTaxHeader
source: Taxing a vehicle
cy_gb: Trethu cerbyd

# RenewTaxPaymentText
source: Pay
cy_gb: Talu

# RenewTaxReferenceNumberStepText
source: Your vehicle
cy_gb: Eich cerbyd

# RenewTaxVEDConfirmationText
source: Renewal period check
cy_gb: Gwirio cyfnod adnewyddu

# RenewTaxVedPickerText
source: Renewal period
cy_gb: Cyfnod adnewyddu

# SearchAgainButtonText
source: Search again
cy_gb: Chwilio eto

# SearchButtonText
source: Search
cy_gb: Chwilio

# SelectText
source: Select
cy_gb: Dewis

source: Service
cy_gb: Gwasanaeth

# SixMonthRate
source: 6 Months rate
cy_gb: Cyfradd 6 mis

# SixMonths
source: 6 Months
cy_gb: 6 Mis

# SornButtonText
source: Make SORN
cy_gb: HOS

# SornDisclaimerText
source: Please be aware that if the vehicle has recently been taxed or a SORN declared, these details may not yet be updated on the vehicle record.
cy_gb: Byddwch yn ymwybodol os bydd y cerbyd wedi ei drethu'n ddiweddar neu HOS wedi ei ddatgan, efallai na fydd y manylion hyn wedi eu diweddaru hyd yma ar gofnod y cerbyd.

# SORNVehicle
source: Tell us you’re taking your vehicle off the road
cy_gb: Dywedwch wrthym eich bod yn cymryd eich cerbyd oddi ar y ffordd

source: Start date
cy_gb: Dyddiad cychwyn

# StartDatePrompt
source: Select start date for your tax:
cy_gb: Dewiswch ddyddiad cychwyn ar gyfer eich treth:

# StartDatePrompt1
source: Select start date for your tax:
cy_gb: Dewiswch ddyddiad cychwyn ar gyfer eich treth:

# StartDatePromptDeclaration
source: If you choose to tax from the 1<sup>st</sup> of the following month, please be aware that the vehicle will remain untaxed or a SORN will remain in force until the 1<sup>st</sup> day of the next month. The vehicle cannot be used or kept on a public road until the 1<sup>st</sup> of the next month.
cy_gb: Os dewiswch drethu o’r 1<sup>st</sup> o’r mis canlynol, byddwch yn ymwybodol y bydd eich cerbyd yn parhau heb ei drethu neu bydd HOS mewn grym tan y 1<sup>st</sup> o’r mis nesaf. Ni ellir defnyddio’r cerbyd ar ffordd gyhoeddus tan 1 <sup>st</sup> o’r mis nesaf.

# SubmitDeclarationText
source: Submit declaration
cy_gb: Cyflwyno datganiad

source: Tax band
cy_gb: Band Treth

source: Tax class
cy_gb: Dosbarth Treth

# TaxDiscDeliveryMessage
source: The tax disc will be dispatched to the registered keeper of the vehicle address currently held by DVLA and should arrive within 5 working days.
cy_gb: Anfonir y ddisg dreth at y perchennog cofrestredig i'r cyfeiriad sydd gan y DVLA ar hyn o bryd, a dylai gyrraedd cyn pen 5 diwrnod gwaith.

# ThankYouPaymentText
source: Thank you for your payment
cy_gb: Diolch am eich taliad

source: Today
cy_gb: Heddiw

# ToText
source: to
cy_gb: i

source: Try again
cy_gb: Geisio eto

# TwelvemonthRate
source: 12 Months rate
cy_gb: Cyfradd 12 Mis

# TwelveMonths
source: 12 Months
cy_gb: 12 Mis

# V11ErrorMessage
source: Enter the full 16 digit number
cy_gb: Rhowch y rhif 16 digid llawn

# V11ErrorMessageMin
source: You must enter your 16 digit reference number
cy_gb: Rhaid i chi roi eich rhif cyfeirnod 16 digid

# V11RefNumImageText
source: Your V11 reminder reference number can be found on the front of your V11 reminder :
cy_gb: Mae eich rhif cyfeirnod atgoffa V11 i'w weld ar flaen eich nodyn atgoffa V11:

# V11ReminderHeader
source: First we need your vehicle details
cy_gb: Yn gyntaf rydym angen manylion eich cerbyd

# V11ReminderMessage
source: Please type the 16 digit reference number from your V11 reminder
cy_gb: Teipiwch y rhif cyfeirnod 16 digid o'ch nodyn atgoffa V11

# V149Text
source: Rates of vehicle tax (V149)
cy_gb: Cyfraddau treth cerbyd (V149)

# V5CDocumentReferenceNumberText
source: V5C document reference number (optional)
cy_gb: Rhif cyfeirnod dogfen V5C (dewisol)

# V5CErrorMessage
source: Enter the full 11 digit number
cy_gb: Rhowch y cyfeirnod 11 digid i fewn

# V5CErrorMessageMin
source: You must enter your 11 digit reference number
cy_gb: Rhaid i chi roi eich rhif cyfeirnod 11 digid

# V5CImageText
source: Your V5C document reference number can be found on the front of your V5C :
cy_gb: Mae eich rhif cyfeirnod dogfen V5C i'w weld ar flaen eich nodyn atgoffa V5C:

# V5CNumberMessage
source: Please type the 11 digit reference number from the front of your registration certificate
cy_gb: Teipiwch y rhif cyfeirnod 11 digid o flaen eich tystysgrif cofrestru

# V5CVRMMessage
source: Add your registration number
cy_gb: Ychwanegwch eich rhif cofrestru

source: valid from
cy_gb: yn ddilys o

# VCSAddress
source: <p>VCS</p> <p>DVLA</p> <p>Swansea</p> <p>SA99 1BA</p>
cy_gb: <p>VCS</p> <p>DVLA</p> <p>Abertawe</p> <p>SA99 1BA</p>

source: VED commencement date
cy_gb: Dyddiad cychwyn VED

# VEDConfirmationHeader
source: The vehicle tax you applied for is:
cy_gb: Y ddisg a ymgeisiwyd amdani yw:

# VEDContinueMessage
source: Are you happy to continue? The details are:
cy_gb: A ydych yn fodlon parhau? Y manylion yw:

source: VED exempt
cy_gb: Wedi eithrio rhag VED

# VedExemptionCertificateNumber
source: VED exemption certificate serial number
cy_gb: Rhif cyfres tystysgrif eithrio VED

# VEDValidationMessage
source: Please select the vehicle tax you would like for the vehicle
cy_gb: Dewiswch y ddisg dreth yr hoffech ar gyfer y cerbyd

# VehicleColourText
source: Vehicle colour
cy_gb: Lliw y cerbyd

# VehicleEnquiryHeader
source: Details of the vehicle being checked
cy_gb: Manylion y cerbyd sy’n cael eu harchwilio

# VehicleEnquiryText
source: To make an enquiry enter the vehicle registration number (number plate) and the vehicle make.
cy_gb: I wneud ymholiad rhowch rif cofrestru'r cerbyd (rhif plât) a gwneuthuriad y cerbyd.

# VehicleExciseDutyRateForVehicleText
source: Vehicle excise duty
cy_gb: Treth cerbyd

source: Vehicle make
cy_gb: Gwneuthuriad y cerbyd

# VehicleREV5CMaxValidation
source: The V5C reference number you have provided should be 11 digits
cy_gb: Dylai'r rhif cyfeirnod V5C a roddwyd gennych gynnwys 11 digid

# VehicleREV5CMinValidation
source: Your reference number should contain 11 digits only
cy_gb: Dylai eich rhif cyfeirnod gynnwys 11 digid yn unig

# VehicleSearchDDLMaxValidation
source: Please select your vehicle from the drop down or enter your make in the 'other' field
cy_gb: Dewiswch eich cerbyd o'r gwymplen neu rhowch y gwneuthuriad yn y maes 'arall'

# VehicleSearchDDLMinValidation
source: You must select your vehicle make from the list
cy_gb: Rhaid i chi ddewis eich gwneuthuriad o'r rhestr

# VehicleSearchMaxValidation
source: You must enter your registration number in a valid format
cy_gb: Rhaid i chi roi'r rhif cofrestru mewn ffurf ddilys

# VehicleSearchMinValidation
source: The registration number you provided is invalid
cy_gb: Mae'r rhif cofrestru a roesoch yn annilys

# VehicleSearchRequiredMaxValidationText
source: You must enter your registration number in order to view your vehicle record
cy_gb: Rhaid i chi roi rhif cofrestru er mwyn cael gweld cofnod eich cerbyd

# VehicleSearchRequiredMinValidationText
source: Please enter your registration number
cy_gb: Rhowch eich rhif cofrestru

# VehicleSornStatus
source: Tax/SORN status
cy_gb: Statws Treth/HOS

# VehicleStatusText
source: Vehicle status
cy_gb: Statws Cerbyd

# VehicleTypeApprovalText
source: Vehicle type approval
cy_gb: Cymeradwyaeth math Cerbyd

# VehicleVRN
source: Registration number
cy_gb: Rhif cofrestru

# VRMErrorMessage
source: You must enter your registration number
cy_gb: Rhaid i chi roi eich rhif cofrestru

# VRMErrorMessageMin
source: You must enter your registration number
cy_gb: Rhaid i chi roi eich rhif cofrestru

# WhereV11Num
source: Where is my V11 reminder reference number?
cy_gb: Lle mae fy rhif cyfeirnod atgoffa V11

# WhereV5CNum
source: Where is my V5C document reference number?
cy_gb: Lle mae fy rhif cyfeirnod dogfen V5C

# YearAgo
source: 1 year ago
cy_gb: Blwyddyn yn ôl

# YearOfManufactureText
source: Year of manufacture
cy_gb: Blwyddyn gwneuthuriad

# YearsAgo
source: {0} years ago
cy_gb: 10 mlynedd yn ôl

source: Yesterday
cy_gb: Ddoe

# V5C2ErrorMessage
source: GB new keeper - please enter the full 12 digit number from your V5C/2. NI new keeper – sorry, due to NI insurance legislation, new keepers must tax at a Post Office® branch that deals with vehicle tax.
cy_gb: Ceidwad newydd Prydain Fawr- rhowch y rhif 12 digid llawn oddi wrth eich V5C/2W. Ceidwad newydd Gogledd Iwerddon - mae'n ddrwg gennyf, oherwydd deddfwriaeth yswiriant GI mae'n rhaid i geidwaid newydd drethu yn un o ganghennau Swyddfa'r Post ® sy'n delio â threth cerbyd.

# V5C2NumberMessage
source: Please type the reference number from the front of your new keeper supplement (V5C/2)
cy_gb: Teipiwch y rhif cyfeirnod sydd ar flaen eich atodiad ceidwad newydd (V5C/2W)

# V5CRadioText1
source: Existing keeper (using V5C document reference number)
cy_gb: Ceidwad Presennol (yn defnyddio rhif cyfeirnod y ddogfen V5CW)

# V5CRadioText2
source: New keeper (using V5C/2 new keeper supplement document reference number)
cy_gb: Ceidwad newydd (yn defnyddio rhif cyfeirnod y ddogfen V5CW/2 atodiad ceidwad newydd)

# V5C2ErrorMessageMin
source: You must enter your 12 digit reference number
cy_gb: Mae'n rhaid i chi roi eich rhif cyfeirnod 12 digid

# V5C2ImageText
source: Your V5C/2 document reference number can be found on the front of your V5C/2 :
cy_gb: Gellir dod o hyd i rif cyfeirnod eich dogfen V5CW/2 ar flaen eich V5CW/2

# WhereV5C2Num
source: Where is my V5C/2 document reference number?
cy_gb: Lle mae fy rhif cyfeirnod dogfen V5CW/2?

# cccontainer
source: Debit or credit card
cy_gb: Cerdyn debyd neu credyd

# ddcontainer
source: Or pay by direct debit
cy_gb: Neu talwch drwy debyd uniongyrchol

# OneMonthly
source: Monthly (approximately <strong>{0:C}</strong> per month) totalling
cy_gb: Misol (tua <strong>{0:C}</strong> y mis) cyfanswm o

# SixMonthly
source: 6 months (one off payment) at
cy_gb: 6 mis (un taliad unigol) o

# TwelveMonthly
source: 12 months (one off payment) at
cy_gb: 12 mis (un taliad unigol) o

# WhereToFindThisText
source: Where to find this
cy_gb: Lle i ddod o hyd i hyn

# NoV11HeaderSORNNewKeeper
source: If you are a new keeper you can only make a SORN using a Statutory Off Road Notification (SORN) form V890. Go to <a alt="www.gov.uk/dvlaforms" href="http://www.gov.uk/dvlaforms" target="_blank" rel="external">www.gov.uk/dvlaforms</a>
cy_gb: Os ydych yn geidwad newydd, gallwch wneud HOS dim ond drwy ddefnyddio ffurflen V890 Hysbysiad Oddi-ar-ffordd Statudol (HOS). Ewch i <a alt="www.gov.uk/dvlaforms" href="http://www.gov.uk/dvlaforms" target="_blank" rel="external">www.gov.uk/dvlaforms</a>

# ServiceNameSorn
source: Make a SORN
cy_gb: Gwneud HOS

# ServiceNameTax
source: Vehicle tax
cy_gb: Treth cerbyd

# ServiceNameVes
source: Vehicle enquiry
cy_gb: Ymholiad cerbyd

# ServiceNameMot
source: Mot history
cy_gb: Mot history [WELSH TRANSLATION]

# V5C2ErrorMessageSORN
source: Please enter the reference number from your V5C/2
cy_gb: Rhowch mewn y cyfeirnod oddi wrth eich V5C/2W

# RenewTaxHeaderStep2
source: Check vehicle details
cy_gb: Gwirio manylion cerbyd

# RenewTaxHeaderStep3
source: Payment
cy_gb: Taliad

# RenewTaxHeaderStep4
source: Check the details
cy_gb: Gwiriwch y manylion

# RenewTaxHeaderStep5
source: Pay
cy_gb: Talu
